src/Ssl_CI/Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИОбработки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SslCI_АдресВРепозитории</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>450</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_ИДКоммита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_АвторКоммита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_ДатаКоммита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_СообщениеКоммита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_ИмяВетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_НеОбновлятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыСписка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыОбъекта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Ssl_CI/Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаполнениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СозданиеСвязанныхОбъектов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Ssl_CI/Enums/ВариантыПубликацииДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВариантыПубликацииДополнительныхОтчетовИОбработок</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РежимОтладки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Ssl_CI/Catalogs/ДополнительныеОтчетыИОбработки/Forms/SslCI_ВыборФайлаИзРепозитория/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	SslCI_РаботаСГитом.ЗаполнитьСписокВеток(Элементы);
	
	Обновить(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидОбработки") Тогда
		Фильтр = ФильтрПоВиду(Параметры.ВидОбработки);
	Иначе
		Элементы.Фильтр.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийАдрес") Тогда
		ТекущийАдрес = Параметры.ТекущийАдрес;
	КонецЕсли;
	
	Если Параметры.Свойство("Ветка") Тогда
		Ветка = Параметры.Ветка;
	Иначе
		Ветка = "master";	
	КонецЕсли;
	
	// Отраслевая специфика. 
	Если Метаданные.Константы.Найти("ЭтоРабочаяБаза_ФХС") <> Неопределено
		И Константы["ЭтоРабочаяБаза_ФХС"].Получить() = Истина Тогда
		Элементы.Ветка.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВеткаПриИзменении(Элемент)
	Обновить(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоФайлов

&НаКлиенте
Процедура ДеревоФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	ВыборЗначения(ВыбраннаяСтрока);	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФайловВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ВыборЗначения(Значение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	Если Ветка = "" Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРепозитория = SslCI_РаботаСГитом.ПолучитьДанныеРепозитория(Ветка, Фильтр);
	
	РазложитьДанныеВДерево(ДанныеРепозитория);
	
	Если ЗначениеЗаполнено(ТекущийАдрес) Тогда
		ИдентификаторСтроки = 0;
		ПрекратитьПоиск 	= Ложь;
		НайтиСтрокуДерева(ДеревоФайлов.ПолучитьЭлементы(), ИдентификаторСтроки, ПрекратитьПоиск);
		
		Если ИдентификаторСтроки <> 0 Тогда 
			Элементы.ДеревоФайлов.ТекущаяСтрока = ИдентификаторСтроки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РазложитьДанныеВДерево(ДанныеРепозитория)
	
	ДеревоФайлов.ПолучитьЭлементы().Очистить();
	
	Если Не ДанныеРепозитория.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ДеревоФайлов");
	
	Исключения = ПолучитьИспользованныеИмена(ТекущийАдрес);
	
	Для Каждого Файл Из ДанныеРепозитория Цикл
		
		Если Исключения.Найти(Файл) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураХранения = СтрРазделить(Файл, "/", Ложь);
		
		ТекВетка = Неопределено;
		Для Каждого Каталог Из СтруктураХранения Цикл
			Если ТекВетка = Неопределено Тогда
				ТекВетка = Дерево;
			КонецЕсли;
			
			ЦелеваяВетка = ТекВетка.Строки.Найти(Каталог);
			
			Если ЦелеваяВетка = Неопределено Тогда
				ЦелеваяВетка = ТекВетка.Строки.Добавить();
				ЦелеваяВетка.ИмяФайла = Каталог;
				
				Если СтрНайти(Каталог, ".", НаправлениеПоиска.СКонца) > 0 Тогда
					ЦелеваяВетка.Картинка = 3;
					ЦелеваяВетка.ПолныйПутьКФайлу = Файл; 
				КонецЕсли;
			КонецЕсли;
			
			ТекВетка = ЦелеваяВетка;
		КонецЦикла;		
	КонецЦикла;
	
	Дерево.Строки.Сортировать("Картинка Возр, ИмяФайла Возр", Истина); 
	
	ЗначениеВДанныеФормы(Дерево, ДеревоФайлов); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФильтрПоВиду(Вид)

	Если Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет
		Или Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет Тогда
		Возврат "erf";
	Иначе
		Возврат "epf";	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыборЗначения(ВыбраннаяСтрока)
	
	ДанныеСтроки = Элементы.ДеревоФайлов.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если ДанныеСтроки.Картинка = 3 Тогда
		СтруктураФайла = Новый Структура;
		СтруктураФайла.Вставить("ПолныйПутьКФайлу", ДанныеСтроки.ПолныйПутьКФайлу);
		СтруктураФайла.Вставить("Ветка", Ветка); 	
		
		ОповеститьОВыборе(СтруктураФайла);
	Иначе
		ТекстСообщения = НСтр("ru='Нужно выбрать файл в каталоге'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСтрокуДерева(КоллекцияЭлементовДерева, ИдентификаторСтроки, ПрекратитьПоиск)

    Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
        Если ПрекратитьПоиск Тогда
            Возврат;
        КонецЕсли;

        Если СтрокаДерева.ПолныйПутьКФайлу = ТекущийАдрес Тогда
            ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
            ПрекратитьПоиск = Истина;
            Возврат;
        КонецЕсли;

        КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();

        Если КоллекцияЭлементов.Количество() > 0 Тогда
            НайтиСтрокуДерева(КоллекцияЭлементов, ИдентификаторСтроки, ПрекратитьПоиск);
        КонецЕсли;
    КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИспользованныеИмена(ТекущийАдрес)
	
	Ответ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийАдрес", ТекущийАдрес);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработки.SslCI_АдресВРепозитории КАК SslCI_АдресВРепозитории
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.SslCI_АдресВРепозитории <> &ТекущийАдрес
	|	И ДополнительныеОтчетыИОбработки.Публикация <> ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Отключена)";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Ответ = Результат.Выгрузить().ВыгрузитьКолонку("SslCI_АдресВРепозитории");	
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

#КонецОбласти
